[{"title":"How do I post a job on Unity Connect?","authorName":"Lily.","createdDate":"2016-05-27T13:27:50Z","updatedDate":"2017-06-30T08:22:56Z","labels":["Post","Connect","Talent","Job","Job Posting","Unity Connect","job","connect","unity connect","job posting","post","post job","Post Job","outsource","Outsource","part time","Part Time","Full Time","talent"],"sections":[{"title":"Symptoms","content":["\n<li>I would like to post a job advertisement as a Client for Talent to apply for.</li>\n<li>I would like to know the best way to post a job offer on Unity Connect</li>\n"]},{"title":"Cause","content":["Joining Unity Connect as a Client allows you to post a job opening on the website."]},{"title":"Resolution","content":["To find talent through Unity Connect, you will need to submit a job post. You must click on the blue &apos;post job&apos; button, on the header of the page, to do so:"]},{"title":"","content":["You will then be asked what kind of role you are posting. Is this a task, or is this a job? Here, you will need to choose if you are looking for a new member of your team, or if you are looking to outsource work for a specific project.","<img src=\"/hc/article_attachments/115005980983/Connect_2.png\" alt=\"Connect_2.png\" width=\"604\" height=\"360\">","Once this has been decided you can then post your specific job or task role, and what you are looking for. You will need to fill out your <em>Company Name, Job Title, Location, Skills, Experience Level of Unity, Unity Certified, Job Type, </em>and any specific questions that you may want to ask applicants!","Once you have submitted the information of the open role, the job opening can then be found under the &apos;Recruit&apos; button. This will show both your Active and Expired listings. From here, you will be able to manage the particular role and see stats such as the amount of applicants interested in your role.","<img src=\"/hc/article_attachments/115005981843/Connect_3.png\" alt=\"Connect_3.png\" width=\"524\" height=\"240\">","Each job post will remain visible for 30 days."]},{"title":"More Information","content":["All job posts are free to Clients during the Beta period. Currently, we have plans to charge Clients for posting jobs in the future, however we will not charge retroactively for previous job posts.","We will make a full announcement once charges&#xA0;apply."]}]}]