[{"title":"How do I use Unity Connect to find talent?","authorName":"Lily.","createdDate":"2016-05-27T11:35:10Z","updatedDate":"2017-06-30T08:20:06Z","labels":["Connect","Talent","Client","Skills","Filters","Job","Unity Connect","job","recruit","connect","unity connect","Recruit","talent","client","skills","filters","Candidates","candidates"],"sections":[{"title":"Symptoms","content":["\n<li>I am a Client and I would like to find Talent for my project.</li>\n<li>I would like to know how Clients connect with people.</li>\n"]},{"title":"Cause","content":["Unity Connect aims to enable Clients to find Talent easily. We have set up a tagging system to help make searching more specific."]},{"title":"Resolution","content":["After you have posted your job advert, you are then able to start the recruitment process, by accessing the&#xA0; recruiting features.","To do so, you will need to the click on the &apos;Recruit&apos; button, and choose the specific job that you are looking to recruit for. A list of candidates based on preliminary matching keywords will show. Then, you can begin to filter down. (for example by Location)","<span><img src=\"/hc/article_attachments/115005983083/connect_5.png\" alt=\"connect_5.png\" width=\"599\" height=\"282\"></span>","We strongly recommend using the skill keyword function while searching, as you can use these to your advantage, only showing Talent with the same tags as the ones you have selected.","Using tags that refer to your project, such as the platform you are building your project to, or the type of role you are trying to fulfil, will allow you to shortlist the potential Talent effectively. You can also use tags to focus on the skills you are looking for.","Unity Connect also has a selection of filters to help you narrow down the results to help Clients find the talent they want."]},{"title":"More Information","content":["For guidance on how to post a job to Unity Connect, see this <a href=\"/hc/en-us/articles/210621763\" target=\"_blank\">article</a>.&#xA0;"]}]}]