[{"title":"How do I sign up to Unity Connect?","authorName":"Derek.","createdDate":"2016-05-27T14:28:06Z","updatedDate":"2017-04-20T12:48:11Z","labels":["Sign Up","Connect","Unity Connect","Sign in","Join"],"sections":[{"title":"Symptoms","content":["\n<li>I would like to join Unity Connect as a Client and post jobs onto your website.</li>\n<li>I am looking for job opportunities and want to join Unity Connect as Talent.</li>\n"]},{"title":"Cause","content":["Unity Connect is a great way to look for work in the games industry or advertise a job you may have available.&#xA0;","If you would like to advertise your skills as a Contractor, or post jobs to receive applicants from our diverse Community, Connect is a good place to start. Connect helps puts you in contact with the people you need.&#xA0;"]},{"title":"Resolution","content":["You will be able to sign in <a href=\"https://connect.unity.com/\" target=\"_blank\">here</a>. Whether you are a Unity developer, student, recruiter, or a professor, all our users log in the same way through Unity&apos;s central ID portal. If you are encountering issues, please be patient. The re-send confirmation email might take a while. If there is still a problem, please contact us <a href=\"https://support.unity3d.com/hc/en-us/requests/new%20\" target=\"_blank\">here</a>.","Once you are logged in you will be presented with a page which has the latest updates in Unity Connect. These sometimes include advertisements for contests with cash prizes so it will always be worth checking before continuing.","At the top of the page you will see some options&#xA0;to chose from:","<img src=\"/hc/article_attachments/115005985663/connect_6.png\" alt=\"connect_6.png\" width=\"683\" height=\"115\">","If you are looking to be hired for your services you can click &quot;Jobs&quot; and you will be asked to fill out your profile. At this stage you can give the details of what kind of work you are looking for.&#xA0;","If you are looking to hire&#xA0;a&#xA0;contractor or full time employee to help you with your project then click &quot;recruit&quot; Here you will be given the chance to advertise what kind&#xA0;of Job or task it is available.&#xA0;","If you would like to browse users and projects together then you can click &quot;Discover&quot; where you can view all projects and talent that are available."]},{"title":"More Information","content":["If you are signing up as Talent, you can view example profiles to give you guidance on your own. These will be visible at the bottom of the initial sign up page."]}]}]