[{"title":"Do I need to resubmit my asset to be featured in the Sales again?","authorName":"Ben.","createdDate":"2015-09-10T15:39:46Z","updatedDate":"2017-07-10T03:04:37Z","labels":["Sale","Asset Store","Sales","Resubmit","Madness Sale","sales","sale","asset store","resubmit","madness sale","chosen for sale","Chosen For Sale","asset chosen","Asset Chosen","featured asset","Featured Asset"],"sections":[{"title":"Symptoms","content":["\n<li><span>I have been in a Sale after submitting my asset via the </span><a href=\"https://docs.google.com/a/unity3d.com/forms/d/1eL91dQ2uttWV0hyIPjiYizP98BIxQOfrNx95NfJiLqI/viewform\" target=\"_blank\"><span>Sales Application Form</span></a></li>\n<li><span>I would like to know how I can be featured in a Sale again, or if I will be featured again without resubmitting my asset.</span></li>\n"]},{"title":"Cause","content":["<span>Once your asset is chosen for a Sale, then it is kept on the Sales list. Your asset will then be put &#x2018;on pause&#x2019; so that other Publishers have a chance to be featured. Spacing out sales on your asset will also increase the effectiveness of the sale.</span>"]},{"title":"Resolution","content":["<span>There is no need to resubmit the Sales Application Form, as you will be kept on the list from your first submission.</span>"]},{"title":"More Information","content":["<span>We ask that Publishers avoid creating their own personal sales, however this is not forbidden. If you do decide to add your own discount, then you will need to change the price by submitting it as an update via publisher administration. If you change the graphics of your asset to highlight your personal sale, for example (30% OFF), then the update to the asset will be rejected. Note that specific guidelines apply to personal sales. These can be found in section 2.7 of our </span><a href=\"https://unity3d.com/asset-store/sell-assets/submission-guidelines\" target=\"_blank\"><span>Submission Guidelines</span></a><span>.</span>","&#xA0;","&#xA0;"]}]}]