[{"title":"How do I increase the ad revenue I gain from using Unity Ads in my app?","authorName":"Unity Ads Support.","createdDate":"2017-01-19T14:37:29Z","updatedDate":"2017-04-13T11:33:03Z","labels":["Ads","Unity Ads","Revenue","eCPM"],"sections":[{"title":"Symptoms","content":["\n<li>I am trying to&#xA0;increase the amount of revenue I get from users viewing ads in my app.</li>\n"]},{"title":"Cause","content":["Your app is generating revenue, but you would like it to generate more.&#xA0;"]},{"title":"Resolution","content":["A low eCPM can indicate there is something inconsistent with your app. It could be that there are too many ads showing, or that the placements are not optimal. There are many different ways you can increase your revenue, for example:","\n<li><strong>Integration&#xA0;</strong>- Look at the way you have integrated ads. Have a look at other games or apps that use ads and see where you could make improvements. Showing fewer ads helps the important placements perform better.&#xA0;A PDF containing placement advice is attached to this article.</li>\n<li><strong>Availability&#xA0;</strong>- Increase the number of countries that your app is available in. By doing this, you increase the number of people who can see your game, which in turn increases the number of ad views.</li>\n<li><strong>Rewards&#xA0;</strong> - Use ads to virtually reward your players. This can be anything from extra currency or lives to unlocking entire levels. Giving your players rewards gives them more reason to view the ads. Combining opt-in rewarded ads with compulsory rewarded ads is not recommended as it reduces the desire to view the opt-in ads.</li>\n"]},{"title":"More Information","content":["The eCPM is the effective cost per 1000 impressions, and&#xA0;is essentially a performance value used to indicate the effectiveness of ads shown in your game. The more impressions you have, the more reliable this value is.","For more information, please see the following article on&#xA0;<a href=\"https://support.unity3d.com/hc/en-us/articles/210954246-Why-am-I-not-seeing-any-revenue-even-with-100-impressions-\" target=\"_blank\">why you may not be seeing any revenue, even with 100 impressions</a>.&#xA0;"]}]}]