[{"title":"How do I add collaborators to my project?","authorName":"Sophia.","createdDate":"2017-01-30T14:48:18Z","updatedDate":"2017-04-13T12:08:24Z","labels":["Collaborate","Collaborator","Organizations","Unity Collaborate","Organization","Organisation","Collab","Teams"],"sections":[{"title":"Symptoms","content":["\n<li>I want to add members of my team to my Unity Collaborate project.</li>\n<li>I don&apos;t know how to share my project with the members of my organization.</li>\n"]},{"title":"Cause","content":["You would like to add users to your Collaborate project."]},{"title":"Resolution","content":["There are multiple ways that you can start collaborating with your teammates.","First, you will need to ensure that you are <a href=\"https://support.unity3d.com/hc/en-us/articles/206494363?flash_digest=5b70b4cd427b7454a65b034ae07430f363d9599c\" target=\"_blank\">added to the organization</a> that the project was created under. If you are already added, ensure that you are a Manager (or Owner) for that organization.","If you want someone to have access to all of your organization&apos;s projects that are currently on Collaborate, make them an Owner or Manager of the organization. When they open the Unity Editor, they will see an <strong>In The Cloud</strong>&#xA0;option for opening projects.","<img src=\"/hc/en-us/article_attachments/115001458183/Screen_Shot_2017-01-30_at_14.55.36.png\" alt=\"\">","This option is not viable for all users. If you just want someone to have access to particular projects, not all of them, you can use the&#xA0;<strong>Invite Teammate</strong>&#xA0;option found in the Collaborate panel in the Editor.","<img src=\"/hc/en-us/article_attachments/115001480426/Screen_Shot_2017-01-30_at_10.17.45.png\" alt=\"\">","You will then be able to enter the email address of the user you&apos;d like to add to the project.","<img src=\"/hc/en-us/article_attachments/115001458263/Screen_Shot_2017-01-30_at_10.17.55.png\" alt=\"\">","Now your teammates will have access to the project. They can download it via the Collaborate panel, and push their changes as they work on the project."]},{"title":"More Information","content":["For further information, take a look at the following article:","\n<li><a href=\"https://support.unity3d.com/hc/en-us/articles/210202863-What-can-Owners-Managers-and-Users-do-in-my-Unity-Organization-\">What can Owners, Managers and Users do in my Unity Organization?</a></li>\n"]}]}]