[{"title":"Why am I seeing two references of a Mesh in memory?","authorName":"Daniel Robledo.","createdDate":"2017-01-13T15:43:10Z","updatedDate":"2017-05-08T10:31:50Z","labels":["Profiler","Mesh","profiling","asset management"],"sections":[{"title":"Symptoms","content":["\n<li>In the Memory Profiler, I can see two references to a Mesh but there&apos;s only one instance of it in the Scene.</li>\n","<img src=\"/hc/en-us/article_attachments/115000842566/Screenshot_1.png\" alt=\"\">"]},{"title":"Cause","content":["This happens when models are imported with the <strong>Read/Write Enabled</strong> flag.","<img src=\"/hc/en-us/article_attachments/115000842606/Screenshot_2.png\" alt=\"\">","Making a Mesh readable will keep an additional copy of it in system memory (the original reference and the copy for scripting access). <br><br>There are other reasons for Unity to keep the additional copy in the system memory regardless of whether the flag is enabled or not (but it will always keeps a reference in video memory):","\n<li>If the Mesh used as a <strong>Skinned Mesh</strong>.</li>\n<li>If the Mesh is a candidate for dynamic batching.</li>\n<li>A particle system uses the Mesh as an emitter.</li>\n","In certain cases when the Mesh is used with a Mesh Collider, this option also needs to be enabled. These cases include:","\n<li>Negative scaling (for example (-1, 1, 1))</li>\n<li>Shear transform (for example when a rotated Mesh has a scaled parent transform).</li>\n"]},{"title":"Unless you need to access the vertex data for the Mesh or any of your Meshes meet one of the conditions above, setting this flag to false will save you some memory (you can check if a Mesh is readable via scripting by using Mesh.isReadable).If you only want to update a Mesh once or don’t want to modify it any more you can call Mesh.UploadMeshData(true), which makes the Mesh data unreadable from the script and frees up the system memory copy of the data.Keep in mind that Meshes that are not marked as readable will throw an error when accessing any data arrays from a script at runtime. More Information","content":["For more information, consult the following documentation:","\n<li><a href=\"https://docs.unity3d.com/ScriptReference/ModelImporter-isReadable.html\">ModelImporter.isReadable script reference documentation</a></li>\n<li><a href=\"https://docs.unity3d.com/ScriptReference/Mesh-isReadable.html\">Mesh.isReadable script reference documentation</a></li>\n<li><a href=\"https://docs.unity3d.com/ScriptReference/Mesh.UploadMeshData.html\">Mesh.UploadMeshData script reference documentation</a></li>\n"]}]}]