[{"title":"How do I create a minimal repro?","authorName":"Megan.","createdDate":"2015-09-29T11:31:28Z","updatedDate":"2016-12-21T09:44:57Z","labels":["Repro","Scene","Package","editor","Error","Crash","Bug","Technical"],"sections":[{"title":"Symptoms","content":["\n<li>My project is too large to submit via the Bug Reporter. I want to find out if&#xA0;there a way I&#xA0;can simplify the upload</li>\n<li>I want to speed up the process of reporting my bug</li>\n"]},{"title":"Cause","content":["You are experiencing a bug in Unity and want report this via the Bug Reporter. The Bug Reporter&#xA0;requests you&#xA0;attach a project to it, but your project is too large.","To produce a minimal sized project for upload you can create a minimal reproducible (repro)<strong>&#xA0;</strong>rather than upload your entire project. This will not only make for a faster upload and reproducibility of your issue, but as a bonus it can help you troubleshoot it yourself before submitting."]},{"title":"Resolution","content":["To create a minimal reproducible:","\n<li>Ensure that you have made a back up of your project.</li>\n<li>\n<p>Open your project in Unity and open the affected scene</p>\n</li>\n<li>\n<p>Remove extraneous items from the scene - assets not required to see issue</p>\n</li>\n<li>Right click on the scene file in project view and <strong>Export</strong> the scene as a package.</li>\n<li>\n<p>Create a new project entirely and name appropriately</p>\n</li>\n<li>\n<p>Import your scene package into a new scene and make sure you fix and replace any missing scripts</p>\n</li>\n<li>\n<p>Click Play or Build to test your issue is still applicable</p>\n</li>\n<li>\n<p>Go to <strong>Help &gt; Report a bug</strong>&#xA0;where the whole new minimal project will be attached</p>\n</li>\n"]},{"title":"More Information","content":["For more information on how to submit a Bug Report then see this article <a href=\"/hc/en-us/articles/206336985-How-do-I-submit-a-bug-report-\" target=\"_blank\">here</a>","&#xA0;"]}]}]