[{"title":"Why should I use Threads instead of Coroutines?","authorName":"Jordi Bonastre.","createdDate":"2016-05-10T11:34:57Z","updatedDate":"2016-12-21T11:11:08Z","labels":["Coroutines","Threads"],"sections":[{"title":"Symptoms","content":["\n<ul>\n<li>Unity has a functionality called Coroutines that can be a substitution for Threads in some cases.</li>\n</ul>\n"]},{"title":"Cause","content":["&#xA0;","Unity Coroutines use concurrency and Threads use parallelism.","&#xA0;"]},{"title":"Resolution","content":["&#xA0;","The Unity API is not Thread-safe and you are allowed to create Threads without any&#xA0;practical limitations. Unfortunately however, the Unity API should be called from the main thread.","\n<p><em><strong>Why create threads when there are coroutines?</strong></em></p>\n<p>Coroutines have nothing to do with Threads. Coroutine methods can be executed piece by piece over time, but all processes are still done by a single main Thread. If a Coroutine attempts to execute time-consuming operation, the whole application freezes for the time being.</p>\n<p>Threads are different. The execution of separate Threads is managed by the operating system (this actually depends on the .NET&#xA0;implementation). If you have more than one logical CPU, many threads are executed on different CPUs. Thanks to that, any expensive operation will not freeze your game, but it might slow it down a little.</p>\n<p><em><strong>When Threads are suboptimal, Coroutines may be preferable:</strong></em></p>\n<p>Creating a Thread is an expensive operation. If you use a Thread polling design pattern, you have to synchronize your computed data to the main thread. This is a very individual thing, so you have to consider this very carefully. It may even be necessary to perform some performance tests, because synchronization might be more expensive operation than computing your data in the main thread in the first place.</p>\n","Threads are dangerous, so you have to be very careful when synchronizing things back! You also need to remember that&#xA0;Unity API is not Thread-safe, so all calls to Unity API should be done from the main Thread.","&#xA0;","<em><strong>When threads are useful to use:</strong></em>&#xA0;","&#xA0;","When you are computing some expensive and/or long-term operations, Threads can still be useful. Examples of this are:","\n<ul>\n<li>AI</li>\n<li>Pathfinding</li>\n<li>Network communication</li>\n<li>Files&#xA0;operations&#xA0;</li>\n</ul>\n"]},{"title":"More Information","content":["&#xA0;","<a href=\"http://blog.theknightsofunity.com/myths-and-facts-of-unity-game-engine/\" target=\"_blank\" rel=\"noreferrer\">http://blog.theknightsofunity.com/myths-and-facts-of-unity-game-engine/</a><br><a href=\"http://blog.theknightsofunity.com/using-threads-unity/\" target=\"_blank\">http://blog.theknightsofunity.com/using-threads-unity/</a>","<a href=\"http://stackoverflow.com/questions/1934715/difference-between-a-coroutine-and-a-thread\" target=\"_blank\">http://stackoverflow.com/questions/1934715/difference-between-a-coroutine-and-a-thread</a>","&#xA0;"]}]}]