[{"title":"How do I enable Two Factor Authentication on my account?","authorName":"Maru.","createdDate":"2016-05-13T09:19:29Z","updatedDate":"2017-06-28T12:05:49Z","labels":["Account","Password","Two Factor Authentication","Security","ID","enable","Enable","account","password","two factor authentication","security","id"],"sections":[{"title":"Symptoms","content":["\n<li>I would like to add Two Factor Authentication to my existing Unity account</li>\n<li>How can I improve the security of my account?</li>\n"]},{"title":"Cause","content":["Unity have taken steps to improve security of our users by implementing Two Factor Authentication. This offers an additional layer of security against unauthorised account access by using your mobile phone."]},{"title":"Resolution","content":["You can enable Two Factor Authentication by going to &apos;Account Settings&apos; on your Unity account.","Under Account Security, you will see the following:","<img src=\"/hc/en-us/article_attachments/204006943/Screen_Shot_2016-05-13_at_10.01.25.png\" alt=\"\">","Select the &apos;+&apos; button to begin the activation process, then select &apos;Start Setup&apos;. You will then be asked to enter your phone details.","<img src=\"/hc/en-us/article_attachments/203796616/Screen_Shot_2016-05-13_at_10.06.29.png\" alt=\"\">","Firstly, select the flag/country of where your phone number resides. This will auto complete the country code field. Once this is done, add your phone number (without any spaces) into the long text field and then select &apos;Next&apos;. You will then be met with a screen to confirm your phone number.","<img src=\"/hc/en-us/article_attachments/203796646/Screen_Shot_2016-05-13_at_10.11.06.png\" alt=\"\">","Your phone number will then receive a code via SMS. Enter the code on this screen and then select &apos;Verify&apos;. Please note that you only have five minutes to verify your code before it expires. If you miss this five minute deadline, you will have to start the process again.","Once you have verified your code, you will then be returned to&#xA0;the &apos;Account Settings&apos; page. If the process has been successful, you will see the status of your Two Factor Authentication as &apos;Activated&apos;, as seen below.","<img src=\"/hc/en-us/article_attachments/204007033/Screen_Shot_2016-05-13_at_10.14.32.png\" alt=\"\">","&#xA0;","If you do not see this upon verifying or you encounter any issues such as not receiving your verification code, please contact Support&#xA0;<a href=\"/hc/en-us/requests/new\" target=\"_blank\">here</a>."]},{"title":"More Information","content":["&#xA0;"]}]}]