[{"title":"Can I produce sound in 48kHz (24bit), or does Unity only work with 44kHz (16bit)?","authorName":"Megan.","createdDate":"2015-11-02T15:57:32Z","updatedDate":"2017-10-25T15:03:29Z","labels":["Samplerate","Bit","Output","Audio"],"sections":[{"title":"Symptoms","content":["\n<li><span>I am the sound designer for all the sound and music in a game </span></li>\n<li><span>My audio files have a sample rate of 48kHz (24bit), but they play back at 44kHz (16bit), which is 2 semitones lower.</span></li>\n<li><span>I want to know if Unity supports audio sampling rates higher than 44kHz (16bit)</span></li>\n"]},{"title":"Cause","content":["<span>You are producing sound and music to be imported into a game. You want to be able to </span><span>play inputs of any sample rate into Unity without the output sampling rate being dramatically reduced.</span>"]},{"title":"Resolution","content":["<span>Unity will play an AudioClip of any input sample rate and will seamlessly resample the audio to Unity&apos;s selected output sample rate 44kHz.</span>"]},{"title":"Audio Output Sample Rates at 44kHz (16bit)","content":["<span>All compressed formats (vorbis, mp3, adpcm etc) convert the AudioClip to 16bit prior to encoding. The compression results in smaller files but with somewhat lower quality but this format is best for medium length sound effects and music.</span>"]},{"title":"Audio Output Sample Rates higher than 48kHz (24bit)","content":["<span>Unity is able however, to support audio output sampling rates higher than 44kHz. If you wish to produce AudioClips in a higher sample rate, this is possible depending on the compression format. If you leave the data uncompressed (PCM) it should stay at 48kHz (24bit). In general, PCM is the only thing that potentially preserves the bit depth. </span><span>This option offers higher quality at the expense of larger file size and is best for very short sound effects.</span>","<span>Setting the sample rate from scripts is not supported in Unity versions 5 and above. This has to be manually set in the Sample Rate Setting. You can modify the sample rate by doing the following:</span>","\n<li><span>Click directly on the AudioClip you have imported into your Project. </span></li>\n<li><span>The following window will appear in your Inspector</span></li>\n","<span><img src=\"/hc/en-us/article_attachments/201817646/5.png\" alt=\"\"></span>","<span>&#xA0; &#xA0; &#xA0;3. Change the Sample Rate Setting in one of three ways:</span>","\n<li><strong><em>Preserve Sample Rate</em></strong><span> - This setting keeps the sample rate unmodified by default</span></li>\n<li><strong><em>Optimize Sample Rate</em></strong><span> - This setting automatically optimizes the sample rate according to the highest frequency content analyzed.</span></li>\n<li><strong><em>Override Sample Rate</em></strong><span> - This setting allows manual overriding of the sample rate and can be used to discard frequency content. </span></li>\n"]},{"title":"More Information","content":[]}]}]