[{"title":"I want my game to trigger an AudioClip, but I cannot hear anything. What is going wrong?","authorName":"Megan.","createdDate":"2015-11-02T15:12:45Z","updatedDate":"2017-03-14T03:00:21Z","labels":["Audio","Trigger","AudipClips","Collider","Rigidbody"],"sections":[{"title":"Symptoms","content":["\n<li><span>I am having trouble playing AudioClips during specific events</span></li>\n<li><span>I want audio to play when my player enters a trigger zone</span></li>\n<li><span>I cannot hear any audio playing</span></li>\n"]},{"title":"Cause","content":["<span>You have created a C# script for an audio trigger in Unity that tells the audio to start playing when a player enters a trigger zone and stop when the player exits. </span>","You have assigned an AudioClip to an Audio Source and attached this to a GameObject in your game.","Your script shows no errors according to the Console (located in the bottom left corner of the Unity Editor), but when your player enters the trigger zone you cannot hear any audio playing."]},{"title":"Resolution","content":["<span>There are potentially two reasons for not hearing the audio when entering a trigger zone:</span>","\n<li><em><span>The </span></em><strong><em>Audio Source</em></strong><em><span> is located too far away from the audio listener attached to the </span></em><strong><em>Scene&#x2019;s Main Camera</em></strong><em><span>. This causes the sound to fade too much to be heard.</span></em></li>\n<li><em><em>You do not have a </em><strong><em>Rigidbody</em></strong><em> attached to your </em><strong><em>Collider </em></strong><em>or</em><strong><em> GameObject</em></strong><em>. Trigger events are only sent if a </em><strong><em>Collider </em></strong><em>or </em><strong><em>GameObject </em></strong><em>has a </em><strong><em>Rigidbody</em></strong><em> attached.</em></em></li>\n","You can make the <strong>Audio Source</strong> be heard at a longer distance by changing the min/max distance properties in the <strong>3D Sound Settings</strong> in your <strong>Inspector</strong>. Or you can make the audio play at the specific distance you want it to be heard by attaching the <strong>Audio Source</strong> to your <strong>Player Controller&#x2019;s Main Camera</strong> in the <strong>Hierarchy</strong> window.","Select your chosen <strong>Collider</strong> and ensure it is set to &#x201C;is trigger&#x201D; in the Inspector. Click <strong>Add Component</strong>. You can search <strong>Rigidbody</strong> and attach this to your <strong>Collider</strong>. You can add a <strong>Rigidbody</strong> to a <strong>GameObject</strong> the same way. The trigger will not register a collision with an incoming <strong>Rigidbody</strong> so instead you will need to modify your script to call <strong><em>OnTriggerEnter();</em></strong> when the <strong>Rigidbody</strong> enters or exits the trigger zone. Below is a C# script showing how audio is played as soon as the Player enters a trigger zone.","<strong><span><img src=\"/hc/en-us/article_attachments/201975103/1.png\" alt=\"\"></span></strong>"]},{"title":"More Information","content":["<span>For more information on Colliders then see this documentation </span><a href=\"http://docs.unity3d.com/ScriptReference/Collider.html\" target=\"_blank\"><span>here</span></a>","&#xA0;"]}]}]