[{"title":"My project is \"too large to build for this tier of service\". How is repository size calculated?","authorName":"Megan.","createdDate":"2015-10-01T11:48:56Z","updatedDate":"2017-04-27T04:35:33Z","labels":["repo","Studio","Enterprise","Cloud Build","Pro","Cloud Build Free"],"sections":[{"title":"Symptoms","content":["\n<li>My&#xA0;cloud build project has failed because my&#xA0;repository has gone over the GB size limit for my plan.</li>\n<li>I would like to know how the repository size is calculated.</li>\n"]},{"title":"Cause","content":["You are&#xA0;subscribed to one of the following Unity Cloud Build plans:","\n<li>Free Plan</li>\n<li>Pro Plan</li>\n<li>Studio Plan</li>\n<li>Enterprise Plan</li>\n","You are trying to build your project, but you are receiving the following error based on your Unity Cloud Build subscription plan:","<em>&quot;postcheckoutstatus failed. Project is too large to build for this tier of service. (2.01 GB exceeds limit by 12.49 MB). See<a class=\"externalLink\" href=\"https://build.cloud.unity3d.com/plans/\" target=\"_blank\" rel=\"nofollow\">https://build.cloud.unity3d.com/plans/</a> to upgrade.&quot;</em>","This&#xA0;limit is based on the size of your repository."]},{"title":"Resolution","content":["Unity Cloud Build calculates the size of all files downloaded from the source control and tries to exclude all hidden files specific to the source control.","If you have the Library or Temp folders in your source control they will be included in the size calculation. Please make sure these Folders are unchecked before you build your project.","If&#xA0;your Library or Temp folders are unchecked and you are still receiving this building failure&#xA0;you can create a new&#xA0;Cloud Build support ticket&#xA0;<a href=\"/hc/en-us/requests/new\" target=\"_blank\">here</a>&#xA0;or post in the <a href=\"http://forum.unity3d.com/threads/project-size-vs-repo-size.306905/\">Unity Cloud Build forums</a>. The Cloud Build team can&#xA0;monitor the build clients used for your project and advise you on how to resolve your issue.","<strong>Note</strong>: Even if your project is in a subfolder of your repository Unity Cloud Build will still clone the whole repository and calculate the size against the whole repository and not only for your project subfolder. &#xA0;"]},{"title":"More Information","content":["You can see the repo size limits required for each tier of Unity Cloud Build <a href=\"https://build.cloud.unity3d.com/plans/\" target=\"_blank\">here</a>."]}]}]