[{"title":"Why are my build times on Cloud Build taking so long?","authorName":"Megan.","createdDate":"2015-10-01T11:45:54Z","updatedDate":"2017-03-17T09:34:30Z","labels":["speed","build times","Cloud Build","Cloud Build Free","Build"],"sections":[{"title":"Symptoms","content":["\n<li>I am building a game via Unity Cloud Build to iOS/Android and it is taking a long time&#xA0;to complete.</li>\n<li>I am on a tight deadline and I need a faster processing speed to build my&#xA0;larger projects.</li>\n"]},{"title":"Cause","content":["You are experiencing a noticeable drop in build speed&#xA0;when you are building your project in Unity Cloud Build.","You may notice this happens more frequently with iOS and Android builds, which are taking over an hour to complete, when compared to local builds in Unity.","You may find that Cloud Build takes 20 minutes for an empty project, while the local build only takes around 7&#xA0;minutes.&#xA0;"]},{"title":"Resolution","content":["Cloud Build usually takes a few minutes extra processing time&#xA0;per build than your&#xA0;local build.<br>This is due to the following tasks Cloud Build will need to perform to complete each build:","\n<li>Each build needs to checkout the project first - The checkout&#xA0;can take a variable amount of time, depending on your hosting solution. The smaller your repository is, the faster the checkout.&#xA0;</li>\n<li>After the checkout, it will verify&#xA0;if it needs to build the <strong>library cache</strong> first or not - It usually has to import a fair number of assets the first time to build the library cache. If <strong>library caching</strong> is turned on, the following are&#xA0;processed much faster.&#xA0;</li>\n","Builds with Cloud Build can be <em>2-3 times</em> as long as a local build, but this also depends on the size of your project. If you have many restarts, or if your builds fail, these factors can also affect the build time.","Each build needs to <strong>checkout</strong> the project from your repository. This varies in download speed depending on your source code hoster and connection to our systems. If you see builds with unusual slow build times, you can also check the status pages of your source code hoster to see if they have problems right now. Big hosters like <a href=\"https://status.github.com/\">GitHub</a> or <a href=\"http://status.bitbucket.org/\">BitBucket</a> provide their own status page similar to the <a href=\"http://status.cloud.unity3d.com/\">Unity Cloud</a> status page. &#xA0;","The first import of a project will be slightly longer when using <strong>library caching</strong> as it builds the Library first. This however, should improve the build speed after the first successful build. If you encounter issues with Library Caching please read the tips found <a href=\"http://forum.unity3d.com/threads/library-cache-being-rebuilt-every-single-time.358168/#post-2318240\">here</a>. <br>Unity Cloud Build is a <em>continuous integration system</em>. The power of Unity Cloud Build is in the capacity of creating distributed and parallel builds. You will gain the most power if you build all platforms for several test purposes at the same time. For example, you can create a Build for Google Play Store, Amazon App Store, a test version, release version and different iOS versions at the same time in parallel.","This helps you to integrate a continuous build pipeline which enables you to work to short deadlines and your developers will not be&#xA0;waiting too long for local builds.","If you notice extraordinary build times, you can create a Cloud Build support ticket&#xA0;<a href=\"/hc/en-us/requests/new\" target=\"_blank\">here</a>&#xA0;or tell us about it in the <a href=\"http://forum.unity3d.com/threads/euhm-whaaaaat.345868/\">Cloud Build Forum</a>. The Cloud Build team can&#xA0;monitor the build clients used for your project and advise you on how to resolve your issue.","The build time can also be increased by restarts. If you encounter many restarts please read <a href=\"/hc/en-us/articles/205215513\">here</a>.&#xA0;"]},{"title":"More Information","content":["Unity Cloud Build has become an increasingly crucial part of many developers workflow and a&#xA0;number of developers have requested&#xA0;faster processing speeds for large projects with very demanding build requirements.","We offer dedicated servers for those customers. Although the Cloud Build remains free, there will be a monthly charge for dedicated servers in the Enterprise Tier. <br>If you think you may need dedicated servers for your upcoming projects, please contact us&#xA0;at <a href=\"mailto:cloudbuild@unity3d.com\">cloudbuild@unity3d.com</a> for details. For more information read&#xA0;<a href=\"http://forum.unity3d.com/threads/access-to-dedicated-build-servers-in-unity-cloud-build.284052/\">here</a>.&#xA0;","For information on general website failures, please see this <a href=\"https://support.unity3d.com/hc/en-us/articles/211247943?flash_digest=a81dd242015f7bf918badfbab3bd7643f10b760d\" target=\"_blank\">article</a>.","&#xA0;"]}]}]