[{"title":"iOS build can not be downloaded or installed from Unity Cloud Build","authorName":"David Berger.","createdDate":"2015-11-18T15:20:35Z","updatedDate":"2017-03-17T09:33:13Z","labels":["Cloud Build","Download","iOS","Failure"],"sections":[{"title":"Symptoms","content":["\n<li>The iOS build download says <em>No Install - Your device is not provisioned for this build.</em>&#xA0;</li>\n<li>When I try to download the build it shows <em>Unable to Download App</em>&#xA0;as iOS dialog popup</li>\n<li>When I try to download the build it shows <em>Unable to Download Application - AppName could not be installed at this time.</em>&#xA0;dialog popup after successful download.&#xA0;</li>\n"]},{"title":"Cause","content":["There are several possible causes:","\n<li>Device storage is full</li>\n<li>Problems with the current session</li>\n<li>The device <em>UDID</em> is not registered in the mobile provisioning profile</li>\n<li>The device <em>UDID</em> is a fake <em>UDID</em></li>\n<li>The ad hoc distribution provisioning profile is corrupted&#xA0;</li>\n<li>The device was restored from a backup and is causing a conflict for over-the-air distribution</li>\n<li>The certificate used for the provisioning profile is <em>revoked</em> or has <em>expired</em></li>\n<li>There was a network timeout</li>\n<li>Architecture settings of the build and the device are incompatible (can sometimes happen when &quot;Build Active Architecture Only&quot; is on when building)</li>\n<li>Not using Mobile Safari</li>\n<li>Mobile Safari is used in <em>private</em> mode</li>\n","There might be different issues which are not known yet. As there are different versions of iOS those issues and their resolution might not have an effect on all versions."]},{"title":"Resolution","content":["To ascertain the correct cause of your problem, you need to connect the test device with a development Mac, open the XCode organizer and choose your connected devices from the sidebar in the devices window. Select the console and install the app again. It will show the exact cause of the problem in the console.","The iOS build download says <em><strong>No Install - Your device is not provisioned for this build</strong>.</em>&#xA0;A very likely cause for the message&#xA0;<em>No Install - Your device is not provisioned for this build&#xA0;</em>is that your UDID is not registered in the development or distribution mobile provisioning profile. You can visit <a href=\"https://build.cloud.unity3d.com/login/me\">https://build.cloud.unity3d.com/login/me</a> on the device and send your build manager the details directly via the <em>Email this Info</em>&#xA0;option. The project needs to be rebuild after adding the UDID and uploading the new provisioning profile so update the build. Read more about the build process <a href=\"https://build.cloud.unity3d.com/support/guides/ios\">here</a>.&#xA0;"]},{"title":"NOTE: There are 3rd party apps which provide you with your UDID which might report fake UDIDs (possibly starting with fffff). You should always use the UDID reported by iTunes.  ","content":["In rare occasions, the current session of the device is broken. This may occur, for example, when you apply a backup of your phone, or the session cookies get corrupted. In such a case, please reset the device by visiting device reset page <a href=\"https://build.cloud.unity3d.com/device/reset\">https://build.cloud.unity3d.com/device/reset</a>&#xA0;which will redirect you to the Unity Cloud Build page after resetting the device session info. If not, please visit it <a href=\"https://build.cloud.unity3d.com/\">manually</a> and log out and log in again to finish the reset process correctly.&#xA0;","Additionally, ensure you are using Safari not in private mode. Unity Cloud Build is not guaranteed to work in other browsers on iOS. Furthermore you can clear the Cache and Cookies of Safari in the Settings menu under &apos;Safari&apos;.&#xA0;","&quot;When I try to download the build it shows <strong><em>Unable to Download App</em></strong>&#xA0;as iOS dialog popup.&quot; If you are having this error appear, your connection might not be stable enough to download the build. Please ensure with your ISP that the connection is stable. If you are in doubt, test a different connection such as over 3G or wired connection. Please also ensure that you have enough free space on your device.","Additionally, it might be possible that the certificate used for the provisioning profile was revoked or deleted. In this case you need to update the certificate and regenerate the provisioning profile. After updating the files via the Unity Cloud Build dashboard, please make sure to rebuild the app, otherwise the change will not have the desired affect. For more information about this topic please read <a href=\"http://stackoverflow.com/questions/25733299/ios-8-cant-install-enterprise-app\">here</a>.&#xA0;","When I try to download the build it shows <strong>Unable to Download Application - AppName could not be installed at this time</strong>&#xA0;as iOS dialog popup after successful download: Please check all above mentioned resolutions as well. Additionally, make sure the device that you want to install the build supports the architecture of the build. Read more about the error message <a href=\"http://stackoverflow.com/questions/14375387/iphone-app-could-not-be-installed-at-this-time%20\">here</a>.&#xA0;"]},{"title":"More Information","content":["For more information&#xA0;about the iOS build process, please read <a href=\"https://build.cloud.unity3d.com/support/guides/ios\">here</a>.&#xA0;<br>Discuss the issue&#xA0;in the Forums <a href=\"http://forum.unity3d.com/threads/unable-to-download-app.367586/\">here</a>.&#xA0;","For more information about the&#xA0;<em>Unable to Download App</em>&#xA0;message read <a href=\"http://stackoverflow.com/questions/25733299/ios-8-cant-install-enterprise-app\">here</a>&#xA0;and for more information about the&#xA0;Unable to <em>Download Application - AppName could not be installed at this time.</em>&#xA0;message please read <a href=\"http://stackoverflow.com/questions/14375387/iphone-app-could-not-be-installed-at-this-time%20\">here</a>. If you need more information about distribution profiles read <a href=\"https://developer.apple.com/library/ios/qa/qa1878/_index.html\">here</a>.&#xA0;","&#xA0;"]}]}]