[{"title":"An asset that I purchased has been removed from the Asset Store. Where can I download it now?","authorName":"Lara.","createdDate":"2015-08-27T13:27:05Z","updatedDate":"2017-07-04T02:48:03Z","labels":["Asset","disabled","Asset Store","user","Download","Remove","Deprecate","User","asset","Disabled","download","asset store","remove","deprecate"],"sections":[{"title":"Symptoms","content":["\n<li><span>I purchased an asset some time ago</span></li>\n<li><span>I wish to download it, but it is no longer on the Asset Store</span></li>\n"]},{"title":"Cause","content":["<span>We have a &#x2018;deprecate&#x2019; feature for our publishers to use, which means that even if they wish to remove an asset from the Store, users that have already purchased it will still have access.&#xA0;</span>Unfortunately, assets that were disabled before this feature came in are not accessible to users.","Assets uploaded to our store by Publishers that are later to be deemed as infringing on copyright grounds would also be removed from our Asset Store. These too would no longer be available for users to purchase."]},{"title":"Resolution","content":["<span>There are a few different ways to answer this:</span>","<strong><em>If you downloaded the asset previously:</em></strong>","<span>If you already downloaded the asset in the past, it may still be on your machine. Please search for the asset files in these locations:</span>","<span>Windows - User&gt;AppData&gt;Roaming&gt;Unity&gt; Asset Store</span>","<span>Mac - User&gt;Library&gt;Unity&gt;Asset Store</span>","<span>Once you have found the asset folder, you can drag and drop the folder into your project to import it.</span>","<strong><em>If you have not downloaded previously and the asset is deprecated:</em></strong>","<span>If the asset has been deprecated by the publisher, this means that only users who have purchased it previously will be able to download. As long as you are logged in with the purchasing account, the download should work.</span>","<span>If the download does not work, please contact Support <a href=\"/hc/en-us/requests/new\" target=\"_blank\" rel=\"noopener noreferrer\">here</a> with your original asset invoice and we will look into it.<br></span>","<strong><em>If you have not downloaded previously and the asset was disabled:</em></strong>","<span>If the Asset has been &apos;disabled&apos;, unfortunately this means it&apos;s no longer available to the public. Please contact support &apos;here&apos; and we will investigate this further for you.<br></span>"]},{"title":"More Information","content":[]}]}]