[{"title":"Can I use assets from the Asset Store in my commercial game?","authorName":"Lily.","createdDate":"2015-09-01T15:24:01Z","updatedDate":"2017-10-24T03:55:39Z","labels":["Asset","Asset Store","selling games","Commercial Use","Legal","legal","asset","asset store","Selling Games","commercial user"],"sections":[{"title":"Symptoms","content":["\n<li>I&#xA0;have bought an&#xA0;asset from the Asset Store.</li>\n<li>I would like to know if I can use it in&#xA0;a game I am going to sell</li>\n<li>I would like to use Unity&apos;s free assets/ the Unity Standard Assets in my game</li>\n"]},{"title":"Cause","content":["You can purchase assets from the Asset Store and use them personally and commercially in your game.","Downloading assets can be useful since it can save time on creating art for the game.","You may <span class=\"il\">use</span> the majority of <span class=\"il\">assets</span> from the Unity Store in other engines without limitation. Please take some time to look at our terms documentation for further details on limitations of usage. This is found <a href=\"http://unity3d.com/legal/as_terms\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>"]},{"title":"Resolution","content":["Once you&#xA0;have&#xA0;purchased an <span class=\"il\">asset</span> from the store, it becomes yours to do with as you like within your games and apps. You will be able to <span class=\"il\">use</span> them in your&#xA0;<span class=\"il\">game</span> for commercial <span class=\"il\">use</span> with no extra payments.<br><br>You can also&#xA0;<span class=\"il\">use</span> free <span class=\"il\">assets</span> in your <span class=\"il\">game</span> for commercial <span class=\"il\">use</span>. Using selected (non-restricted) Unity assets is fine, though be aware that many<span class=\"message_content\"> developers use Unity to create their games and most are aware of the assets we provide.</span>","Unity &quot;Restricted Assets&quot; are subject to restrictions that others are not. These are only valid for personal and non-commercial use only. No other use is permitted, and these Unity assets must not be used in your commercial games.","You cannot duplicate an asset, or include it in an asset-type product."]},{"title":"More Information","content":["You can download Unity&apos;s Standard Assets <a href=\"https://www.assetstore.unity3d.com/en/#!/content/32351\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.","For more information on making&#xA0;a commercial game, please see the following article <a href=\"https://support.unity3d.com/hc/en-us/articles/205253119-Can-I-make-a-commercial-game-with-Unity-Free-Personal-Edition-\">here</a>."]}]}]