[{"title":"What does the Unity Certification Exam involve?","authorName":"Lara.","createdDate":"2016-03-21T12:01:24Z","updatedDate":"2017-03-17T09:21:48Z","labels":["Unity Certification","Exam","Prepare","Certification"],"sections":[{"title":"Symptoms","content":["\n<li>I am interested in becoming a Certified Unity Developer</li>\n<li>I wish to know what the exam involves and how I can prepare for it.</li>\n"]},{"title":"Cause","content":["The pass mark for the Unity Certification Exam is 70% and you will need to prepare to get the best possible score."]},{"title":"Resolution","content":["The Unity Certification Exam is made up of 100 questions in 16 topic areas. There is a time limit of 90 minutes allowed for the Exam.","To prepare for the Exam, there are a few options, depending on your level of experience:","\n<li><span>You can review the Unity Certified Developer Exam Objectives online at </span><a href=\"http://certification.unity.com/objectives\"><span>certification.unity.com/objectives</span></a><span>. The Exam Objectives tell you the topics covered on the exam. Using these, you can decide whether you feel comfortable taking the exam based on your existing Unity knowledge and experience, or whether you need to study.</span></li>\n<li><span><span>If you decide that you need further study before taking the Exam, we will soon</span></span><span> make available Unity Certified Developer Courseware, an online learning program:</span>\n<ul>\n<ul>\n<li><span>Takes you through the process of making a working game with Unity from the ground up, and directly maps to preparation for the certification exam. </span></li>\n<li><span>You can view what will be covered in the courseware at </span><a href=\"http://certification.unity.com/outcomes\"><span>certification.unity.com/outcomes</span></a></li>\n</ul>\n</ul>\n<span><span>You can sign up to get notified as soon as the courseware is available at </span><a href=\"http://certification.unity.com/courseware\"><span>certification.unity.com/courseware</span></a></span></li>\n"]},{"title":"More Information","content":["For information about where you can take your Exam, please see this <a href=\"/hc/en-us/articles/208117686-Where-can-I-take-my-Certification-exam-\" target=\"_blank\">article</a>.","For information on costs related to Certification, please see this <a href=\"/hc/en-us/articles/208117616-How-much-does-Certification-with-Unity-cost-\" target=\"_blank\">article</a>."]}]}]