[{"title":"I am seeing a gambling Ad campaign in my under-13s game.","authorName":"Lara.","createdDate":"2016-02-05T13:42:13Z","updatedDate":"2017-03-17T03:12:58Z","labels":["Ads","Unity Ads","Gambling","Under 13s","Filter"],"sections":[{"title":"Symptoms","content":["\n<li>I have selected the option &apos;Directed for children under age of 13&apos;</li>\n<li>When I build my game, a gambling Ad campaign appears</li>\n<li>My game was rejected from Apple/ Google Play Store due to a simulated gambling themed ad appearing when they tested it</li>\n"]},{"title":"Cause","content":["We do not allow sexually explicit content on our ad network, however there are some gambling campaigns and violent game ads included.","The &quot;Directed for children under age of 13&quot; option within the Unity Ads Services window is used to indicate whether we can collect and use data for behavioral targeting. This dynamically improves the effectiveness of ads by serving to the user ads that are more relevant to them, based on the results of previous ads viewed. This setting does not however, determine if age appropriate content should be shown and filters need to be set through our filtering options."]},{"title":"Resolution","content":["The Unity Ads dashboard currently has some filtering options available for campaigns. You can indicate by genre which types of ads you do not want shown in your game, in this case &quot;Casino&quot; games.","To set your filtering options, please follow the steps below:","\n<li>Select your project from the Unity Ads dashboard.</li>\n<li>Select a platform listed under the project (Android Google Play, iOS App Store).</li>\n<li>Select the <strong>Filtering</strong> tab and select <strong>Edit</strong>.</li>\n<li>Enable the checkboxes next to &quot;Card&quot;, &quot;Casino&quot;, and &quot;Dice&quot; categories.</li>\n<li>Select <strong>Save</strong> to save these changes.</li>\n<li>Repeat steps 2-5 for each platform listed under the project.</li>\n","We are actively working to improve advanced filtering for age appropriate content. Currently, more advanced filtering is something you need to request from us directly by contacting Support <a href=\"http://unityads.unity3d.com/help/help/contact\" target=\"_blank\">here</a> with the game IDs for the games. In the future, advanced filtering will be an option that you can set from the Ads dashboard."]},{"title":"More Information","content":["You can see the Feedback request page on advanced filtering <a href=\"https://feedback.unity3d.com/suggestions/ads-for-different-age-group\" target=\"_blank\">here</a> for updates from our Developers."]}]}]