[{"title":"How can I sign into the Unity website/ Unity Editor?","authorName":"Lara.","createdDate":"2017-08-30T13:10:29Z","updatedDate":"2017-09-19T11:21:44Z","labels":["Account","log in","Editor","Email","Website","ID","Unity ID","Sign-in","id","website","site","login","google","facebook","gmail","google+","sign-in","sign in"],"sections":[{"title":"Symptoms","content":["\n<li>I would like to sign in to the Unity Editor to use the software/ make an Asset Store purchase or download.</li>\n<li>I would like to sign into the Unity website so that I can manage my personal details, licenses, post on the Forums, or make a license purchase.</li>\n"]},{"title":"Cause","content":["<span>The Unity Editor and website require an account to be used for access.<br></span>"]},{"title":"Resolution","content":["You can sign into both the Unity Editor and the Unity website using a Unity ID account, created <a href=\"https://id.unity.com\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>. You can also use this page to sign in if you already have an account.","Alternatively, you can use your Facebook or Google (Gmail) account to create an account for your email address. To do this, follow these steps:","\n<li>Click on the Facebook/ Google login option on the sign in page</li>\n<li>A pop-up for Facebook/ Google will appear. Click &quot;Continue&quot;</li>\n<li>Enter your Facebook/ Google account details to sign in.</li>\n"]},{"title":"More Information","content":["If you sign in with a Facebook/ Google account with an email that already has a Unity account, you will be asked for your Unity password to link the two accounts together. This avoids any confusion that having multiple accounts might cause.&#xA0;&#xA0;","If your Facebook account is not confirmed, or you did not allow Unity to receive your Facebook account email, then the sign in will fail. The solution for this issue is:","\n<li>Try again after your Facebook account is confirmed</li>\n<li>Go to Facebook, under Settings&gt;Apps&gt;Logged in with Facebook&gt;Unity and make sure email is checked</li>\n"]}]}]