[{"title":"Why have I not received my confirmation email?","authorName":"Megan.","createdDate":"2015-08-14T14:59:32Z","updatedDate":"2017-09-15T09:50:46Z","labels":["Account","UDN","can't log in","Confirmation Email","Email Address","account","udn","Can't Log In","confirmation email","email address","confirmation","Confirmation"],"sections":[{"title":"Symptoms","content":["\n<li>I am trying to log into my Unity Account, but I see this message:</li>\n","<img src=\"/hc/en-us/article_attachments/203304706/Screen_Shot_2016-03-30_at_14.39.51.png\" alt=\"\" width=\"505\" height=\"347\">"]},{"title":"Cause","content":["This is an issue&#xA0;that can sometimes occur due to one of these factors:","\n<li>Confirmation email has been sent to spam folder instead of your Inbox</li>\n<li>You have signed up with a different email address</li>\n<li>The email address was not spelled correctly</li>\n<li>Confirmation email has not been sent immediately from our mailing server</li>\n<li>System has not completed registration and the user will need to reattempt to sign up with the same email address</li>\n"]},{"title":"Resolution","content":["If you cannot see your confirmation email, first check your spam folder in case it has been sent there instead of your Inbox folder.","You can request your confirmation email is resent&#xA0;by clicking on the&#xA0;<strong>Can&apos;t find your confirmation email?</strong>&#xA0;button.","Enter the email address you created your Unity Account with and click the <strong>Resend confirmation</strong>&#xA0;button.","Make sure you enter the email address correctly and your confirmation email should be resent to your inbox folder.","<em>Please&#xA0;note,&#xA0;the system can get quite busy, so if you do not receive your confirmation email immediately you may need to wait a short time for it to be processed.</em>"]},{"title":"More Information","content":["If you experience problems confirming your Unity Account that are not described here,&#xA0;you&#xA0;can contact Support <a href=\"/hc/en-us/requests/new\" target=\"_blank\">here</a>.&#xA0;Please make sure you include the <strong>email address </strong>or<strong> username</strong>&#xA0;you signed up with. That way we can check the account details are all correct.&#xA0;","&#xA0;"]}]}]