[{"title":"Why can't I see Shadows on some of my Android Devices?","authorName":"Megan.","createdDate":"2015-11-11T12:57:56Z","updatedDate":"2017-03-14T02:26:14Z","labels":["Shadows","Android","Supported","mobile"],"sections":[{"title":"Symptoms","content":["\n<li>I am unable to see Shadows on my Android Device</li>\n"]},{"title":"Cause","content":["You are making a game in Unity which you want to&#xA0;deploy to an Android mobile platform.","You have made an environment for the scene&#xA0;which includes a directional light and shadows are visible in the editor. When you export your project as an .apk however, you find that the shadows have disappeared from view. This makes the scene appear flat and unrealistic:","<img src=\"/hc/en-us/article_attachments/201936366/2055-missing-shadows.jpg\" alt=\"\" width=\"562\" height=\"676\">"]},{"title":"Resolution","content":["Shadows require hardware support, so the Android device must be capable of showing them. Device supports shadows if it has a <em><strong>&quot;GL_OES_depth_texture&quot;</strong></em> extension.","To determine whether your required device supports shadows:","\n<li>Run the&#xA0;Unity application on the device.</li>\n<li>During the application start up, Unity will print&#xA0;out all available extensions. All extensions&apos; names start with <em><strong>&quot;GL_&quot;</strong></em>.</li>\n<li>If you can&apos;t see the <strong><em>&quot;GL_OES_depth_texture&quot;</em></strong> listed, then your device does not support shadows.</li>\n","Unfortunately,&#xA0;there is no resolution if&#xA0;real shadows are not supported on your specific device. The solution for this is to wait for a new version to be released or roll back a patch release.&#xA0;","<em>Please note that Android disabled shadows for Intel PowerVR devices to avoid graphics artifacts. Unfortunately this means there is no current solution for this at present.</em>"]},{"title":"More Information","content":["You can check&#xA0;the website for&#xA0;our latest patch releases <a href=\"https://unity3d.com/unity/qa/patch-releases\" target=\"_blank\">here</a>","&#xA0;"]}]}]