[{"title":"Why are my streaming Assets making my APK so big?","authorName":"Andy Milsom.","createdDate":"2016-09-29T15:36:40Z","updatedDate":"2017-04-27T03:39:40Z","labels":["Android","StreamingAssets","APK"],"sections":[{"title":"Symptoms","content":["\n<li>My files in the <strong>StreamingAssets</strong> folder are not being compressed in the APK.</li>\n"]},{"title":"Cause","content":["\n<p>The APK is a normal zip file. Files within this&#xA0;file can use a range of compression methods, with the most common being <strong>deflate</strong> and <strong>store</strong>.&#xA0;</p>\n<ul>\n<li><strong>Deflate</strong> is the normal zlib/lz77 compression algorithm.</li>\n<li><strong>Store</strong> is uncompressed raw data, stored as is.</li>\n</ul>\nThe Unity-generated APK will contain files of both kinds, with the StreamingAssets data &#x200B;always&#x200B; using store&#xA0;compression.","&#xA0;","<img src=\"/hc/en-us/article_attachments/208052363/apkCompression.png\" alt=\"\">","&#xA0;","Unity will read the (usually compressed) data from inside&#xA0;the APK file. However, Streaming Assets are left &quot;as is&quot;, and are copied directly into the file structure."]},{"title":"\n\nAlso note that this is the file itself and not the Unity-formatted file used elsewhere. This can be seen by adding a large PSD image file to the StreamingAssets folder, which can then be found inside the APK by extracting its contents and looking at the file inside the extracted Assets folder.\n\nResolution\n","content":["\n<p>If compression is required for the&#xA0;StreamingAssets, this compression must be in the file itself, for example:</p>\n","\n<ul>\n<li>Use a file format that is compressed (for example PNGs and&#xA0;JPGs) - do not use large file formats (such as PSDs)&#xA0;unnecessarily as these will be copied uncompressed.</li>\n<li>Use compressed AssetBundles.</li>\n<li>Reduce the sizes of the Asset files themselves using compression tools such as <a href=\"http://pngcrush.com/\">PNG Crush</a><em>.</em></li>\n</ul>\n"]},{"title":"More Information\nFor more information, consult the Android developer guide to reducing APK size.\n","content":[]}]}]