[{"title":"libhoudini.so crashes on Android x86 devices","authorName":"Jordi Bonastre.","createdDate":"2016-03-30T12:53:19Z","updatedDate":"2017-03-14T02:22:46Z","labels":["Android","Crash","libhoudini","x86","ARM"],"sections":[{"title":"Symptoms","content":["\n<ul>\n<li>Unity crashes when starting in Android x86 devices and the log shows an exception on libhoudini.so.</li>\n</ul>\n"]},{"title":"Cause","content":["&#xA0;","libhoudini is a proprietary ARM translation layer for x86-powered Android devices. It allows an app that has NDK binaries for ARM, but not x86, to still run on x86 hardware, albeit not as quickly as it would with native x86 binaries.","If libhoudini can translate everything, the app will&#xA0;work normally, but as Unity is updating and adding more features, libhoudini lacks some ability to translate everything fully. Result of that is an crash of ARM apps in x86 environment.","&#xA0;"]},{"title":"Resolution","content":["\n<p>Changing the <em>Device Filter</em> on <a href=\"http://docs.unity3d.com/Manual/class-PlayerSettingsAndroid.html\">Android Player Settings</a> solves the problem.&#xA0;</p>\n<p>If the <em>Device Filter</em> is set to &apos;FAT (ARMv7+x86)&apos; it will double the size of the libraries but none of the assets are duplicated. However, two APKs can be created, one for x86 and one for ARMv7 and publish both on Play Store.</p>\n<p><a href=\"http://developer.android.com/intl/zh-cn/google/play/publishing/multiple-apks.html\" rel=\"noreferrer\">http://developer.android.com/intl/zh-cn/google/play/publishing/multiple-apks.html</a>&#xA0;</p>\n","\n<p>One thing to consider with FAT APK&#xA0;is that on x86 all native plugins (.so) should have both arm and x86 versions or Android may decide to use ARM&#xA0;on emulator instead of x86 when the count of libs is less for x86.</p>\n"]},{"title":"More Information","content":["<a href=\"http://docs.unity3d.com/Manual/class-PlayerSettingsAndroid.html\" target=\"_blank\">http://docs.unity3d.com/Manual/class-PlayerSettingsAndroid.html</a>","&#xA0;"]}]}]