[{"title":"I have a great idea on how to improve features for Unity Cloud Build, where can I put my suggestion?","authorName":"Megan.","createdDate":"2015-10-01T11:49:36Z","updatedDate":"2017-03-17T09:37:33Z","labels":["Feature Request","Unity","Feedback","Cloud Build","Developer"],"sections":[{"title":"Symptoms","content":["\n<li>I have some ideas for improvements that would help developers get a better workflow</li>\n<li>I have some ideas to improve Unity&#xA0;Cloud Build features</li>\n"]},{"title":"Cause","content":["We have some pretty brilliant people here at Unity, but we cannot think of everything and are always willing to listen to suggestions you may have on improving Cloud Build&apos;s Features."]},{"title":"Resolution","content":["Please check the Cloud Build <a href=\"http://feedback.unity3d.com/forums/unity/suggestions?utf8=%E2%9C%93&amp;status=0&amp;category=cloud-build&amp;view=hottest\" target=\"_blank\">Feedback</a> page&#xA0;in case someone else has submitted the same idea already (As we say in the UK, &#x2018;Great minds think alike!&#x2019;).","If no one has submitted your idea as feedback, please feel free to create a new post. The more users vote for your idea, the more likely we are to look into implementing it sooner.","It helps us to track the feature requests and we can notify you when it is in progress! It works very simply: Every user receives 10 votes to use and if there is a feature you <em>REALLY</em> care about you can vote for it up to three times.","Each feature has a status:","\n<li><strong>Active</strong>: Any Feedback which is currently not Completed, Declined or Invalid.</li>\n<li><strong>Under review</strong>: We are considering this feature.</li>\n<li><strong>Planned</strong>: We have agreed that this feature should be implemented, and found a place for it on our roadmap</li>\n<li><strong>Started</strong>: We have started work on this feature.</li>\n<li><strong>Completed</strong>: This feature is complete.</li>\n<li><strong>Declined</strong>: We have considered this feature, but decided not to implement it.</li>\n<li><strong>Invalid</strong>: Feedback which was rejected as it does not fit to the Service.</li>\n"]},{"title":"More Information","content":["When you are discussing Unity Cloud Build features on the forum, using Twitter, or other sites, try to remember to link to the feature request on the Feedback site so that other users will find it and up-vote it! If someone suggests something brilliant, encourage them to submit it to the Feedback site, so that it can be documented and considered. The Cloud Build team will try to keep the requests updated and will reach out to the person who posted the request if any clarification is necessary.","Please see this Forum <a href=\"http://forum.unity3d.com/threads/unity-cloud-build-feature-requests.330223/\" target=\"_blank\">thread</a> for more information on Unity Cloud Build Feature Requests.","&#xA0;"]}]}]