[{"title":"Why does my build restart with no explanation in Unity Cloud Build?","authorName":"Megan.","createdDate":"2015-10-01T11:47:36Z","updatedDate":"2017-03-17T09:33:36Z","labels":["restarts","SCM","Cloud Build","iOS","Android","Failure","Build"],"sections":[{"title":"Symptoms","content":["\n<li>I received&#xA0;the error&#xA0;<em>&quot;oops something happened,&quot;</em>&#xA0;which made my&#xA0;build restart.</li>\n<li>There is an unusually high restart rate for the iOS and Android builds on our project.</li>\n<li>There is an unusually high restart rate only for iOS build on our project.&#xA0;</li>\n"]},{"title":"Cause","content":["Your&#xA0;builds keep restarting and/or failing due to an inability to check out the project from your SVN server in a reasonable amount of time. This could be due to the following factors:","\n<li>Your have a&#xA0;large project&#xA0;which you are trying to build locally and your&#xA0;build needs to checkout the project first.</li>\n<li>You may have a weaker SCM&#xA0;server&#xA0;depending on where you are&#xA0;geographically located.</li>\n<li>Your project seems to be much more prone to restarts than others.</li>\n"]},{"title":"Resolution","content":["Your project will restart more frequently if something has gone wrong with the build. This depends on where your source control is hosted, how large your total project is in source control and also how large your compiled Unity project is, as this could produce time-outs. You should check the settings of your firewall and overall connection and checkout speed of your SCM server. If you host it on a external service, you can test the connection speed if you checkout your project locally and compare it with other services. Test different services to find a hoster which suits your project requirements in combination with Unity Cloud Build.","<span class=\"s1\">Restarts on iOS occur as some projects seem much more prone to restarts than others. iOS projects will always be a little more likely to restart as they can hang in either the Unity or the Xcode steps with post-processing, which is unique to iOS as the XCode manipulation API is only available for&#xA0;iOS projects. </span>","<span class=\"s1\">Restarted builds are not subject to cool-downs,&#xA0;and i</span>f you have a high level of&#xA0;restarts, you can create a new&#xA0;Cloud Build support ticket&#xA0;<a href=\"/hc/en-us/requests/new\" target=\"_blank\">here</a>&#xA0;or in the <a href=\"http://forum.unity3d.com/threads/constant-restarting-hanging-on-processing.305986/#post-2001258\">Unity Cloud Build forums</a>. The Cloud Build team can&#xA0;monitor the build clients used for your project and advise you on how to resolve your issue."]},{"title":"More Information","content":["&#xA0;"]}]}]