[{"title":"How do I add an AudioClip to an AssetBundle?","authorName":"Megan.","createdDate":"2015-11-02T14:51:53Z","updatedDate":"2017-03-14T02:56:09Z","labels":["AssetBundles","Audio","Unity 5"],"sections":[{"title":"Symptoms","content":["\n<li>I want to create an AssetBundle for my Unity 5 project, which contains a collection of AudioClips.</li>\n<li><span>My project uses thousands of audio clips. I do not want to import them as individual files.</span></li>\n"]},{"title":"Cause","content":["<span>You are creating a game in Unity 5 and wish to create an AssetBundle to contain your Audio Assets. You have previously successfully built an AssetBundle in previous versions of Unity but when you try to build an AssetBundle with AudioClips in Unity 5, it is not working.</span>"]},{"title":"Resolution","content":["<span>AssetBundles are files which you can export from Unity to contain assets of your choice. These files use a proprietary compressed format. This allows you to stream in content, such as models, textures and AudioClips. AssetBundles have been designed to simplify downloading content to your application.</span>","<span>Please note that this feature is only available to Unity Professional users.</span>","<span>You can create a AssetBundle in the Editor from a drop down section at the bottom of the Inspector window. By default the AssetBundle option is set to None, meaning the asset will not be written into an AssetBundle. You can create new AssetBundle, give it a name, for example </span><em><span>&#x201C;AudioClips&#x201D;</span></em><span> and then use these new AssetBundle names as the destination for the asset.</span>","<span>In order to add audio clips to your AssetBundle:</span>","\n<li><span>Add an </span><strong>Audio Source</strong><span> component to a </span><strong>GameObject</strong></li>\n<li><span>Add the </span><strong>AudioClip</strong><span> to the </span><strong>Audio Source</strong></li>\n<li><span>Create a </span><strong>Prefab</strong><span> on the </span><strong>GameObject</strong></li>\n<li><span>Add the returned </span><strong>Prefab</strong><span> to the </span><strong>AssetBundle</strong><span>.</span></li>\n"]},{"title":"More Information","content":["<span>For more information on creating AssetBundles then see this document </span><a href=\"http://docs.unity3d.com/Manual/AssetBundlesIntro.html\" target=\"_blank\"><span>here</span></a>","<span>For more information on building AssetBundles in Unity 5 then see this document </span><a href=\"http://docs.unity3d.com/Manual/BuildingAssetBundles5x.html\" target=\"_blank\"><span>here</span></a>","&#xA0;"]}]}]