[{"title":"The characters are displayed with a different font. Where can I see the Fallback font list per platform?","authorName":"Esteban.","createdDate":"2015-12-04T17:39:11Z","updatedDate":"2017-02-26T02:51:27Z","labels":["UI","Text","Fonts","Fallback fonts"],"sections":[{"title":"Symptoms","content":["\n<li><span>There is a different font displayed when rendering text between platforms. </span></li>\n<li><span>Some characters are visible in one platform and missing or different in another platform.<br></span></li>\n<li><span>There are strange characters showing where text should be.</span></li>\n"]},{"title":"Cause","content":["\n<li><span>The font used is marked as a dynamic font, and the characters generated dynamically are not the expected ones.<br></span></li>\n<li><span>It is a custom/imported font that does not have the checkbox </span><em><span>Incl. Font Data </span></em><span>marked in the Inspector&apos;s Import Font Settings. When Unity tries to find the characters from the font it cannot find them, because the font asset was not included and the font is not installed on the device/computer.<br></span></li>\n<li><span>The font does not include the requested glyph.</span></li>\n<li><span>Some targeted platforms like WebGL and various consoles </span><span>do not use the OS&apos;s default fonts that Unity can access for rendering text. </span></li>\n"]},{"title":"Resolution","content":["<span>If the font asset does not have the checkbox </span><em><span>Incl. Font Data </span></em><span>marked, mark it. </span><em><span>Incl. Font Data </span></em><span>includes the custom font in the output build and the character data in the Font will be available in the built application. </span>","<span>If Unity cannot find the needed font or glyph, it would search for it and </span><span>will try each of the fonts listed in the</span> <em><span>Font Names</span></em><span> field to see if it can find a font matching the font name in the project, or installed on the user machine which has the requested glyph. </span>The <em>Font Names </em>field in each of the fonts in the project refers to all the specific fallback fonts that are going to be used in the project.<br><span>If none of the fallback fonts (and the requested glyphs) needed for the project are present, Unity will fallback to a hard-coded global list of fallback fonts installed on the current platform (Depends in which platform you&apos;re building for).</span><br><span>It is then recommended that you include all the fonts in the project needed as fallbacks as well as including the fallback font in the</span><em><span> Font Names </span></em><span>field of the font being used. (e.g font1, font2, font3), and when possible, include the font data.<br></span>"]},{"title":"More Information","content":["<span>See the links below:</span>","\n<li><a href=\"http://docs.unity3d.com/Manual/NativePlugins.html\">http://docs.unity3d.com/Manual/class-Font.html</a></li>\n<li><a href=\"http://forum.unity3d.com/threads/thai-font-fallback-for-unity-android.225197/\">http://forum.unity3d.com/threads/thai-font-fallback-for-unity-android.225197/</a></li>\n<li><a href=\"http://answers.unity3d.com/questions/974498/how-do-you-make-fallback-fonts-work.html\">http://answers.unity3d.com/questions/974498/how-do-you-make-fallback-fonts-work.html</a></li>\n","&#xA0;","&#xA0;"]}]}]