[{"title":"Shaders are pink when loaded from an AssetBundle","authorName":"Ryan Parkinson-Faulkner.","createdDate":"2016-03-09T15:36:04Z","updatedDate":"2017-06-13T13:17:21Z","labels":["AssetBundles","editor","Shader","Material","Pink","Model"],"sections":[{"title":"Symptoms","content":["\n<li><span class=\"wysiwyg-font-size-medium\">My shaders/materials/models loaded from an AssetBundle are pink, missing, or broken</span></li>\n<li><span class=\"wysiwyg-font-size-medium\">Shaders that are not loaded from an AssetBundle work correctly</span></li>\n"]},{"title":"Cause","content":["<span class=\"wysiwyg-font-size-medium\">This could be due to a couple of reasons. For example, the shader code inside the AssetBundle may not be supported by the target platform. Another reason could be that there is a reference to the shader stored in the Bundle, but not included in the built player.</span>"]},{"title":"Resolution","content":["<span class=\"wysiwyg-font-size-medium\">&#xA0;</span>","<span class=\"wysiwyg-font-size-medium\">The AssetBundle needs to be built for the correct target platform, for example for Bundles intended to be used on iOS devices:</span>","<span class=\"wysiwyg-font-size-medium\">&#xA0;</span>","<span class=\"wysiwyg-font-size-medium\"><code>BuildPipeline.BuildAssetBundles(&quot;AssetBundles&quot;, BuildAssetBundleOptions.None, BuildTarget.iOS);</code></span>","&#xA0;","<span class=\"wysiwyg-font-size-medium\">The <em>Always Included Shaders</em> list in <a href=\"http://docs.unity3d.com/Manual/class-GraphicsSettings.html\">Graphics Settings</a>&#xA0;needs to stay the same between building and loading the AssetBundle. Unity checks the <em>Always Included Shaders</em> list in <em>Graphics Settings. </em>If a shader is in there, a reference to the shader will be stored in the AssetBundle instead of platform specific shader code. If you then remove this shader from the <em>Always Included Shaders</em> list then it might not be included in your built player, resulting in the shader not being found as the AssetBundle still only includes the reference to the shader.</span>","<span class=\"wysiwyg-font-size-medium\">The Graphics APIs list in the target platform&apos;s <em>Player Settings</em> should contain all needed&#xA0;APIs when building the AssetBundle. If the list changes between building and loading the AssetBundle<span class=\"wysiwyg-font-size-medium\">&#xA0;then the shader code built into the AssetBundle could be for the wrong API, resulting in the shader being unsupported on the target platform.</span></span>"]},{"title":"More Information","content":["<span class=\"wysiwyg-font-size-medium\">When using one Unity project to build the AssetBundles and another Unity project to load the AssetBundles, the problem could be due to the projects having different Graphics APIs lists, or Always Included Shaders lists.</span>"]}]}]