[{"title":"Why am I getting MissingReferenceException in the Editor and a NullReferenceException on mobile devices when running the same piece of code?","authorName":"Sergio Gomez.","createdDate":"2017-01-18T12:05:59Z","updatedDate":"2017-01-31T17:30:09Z","labels":["NullReferenceException","Error","Exception","MissingReferenceException"],"sections":[{"title":"Symptoms","content":["\n<li>A piece of code that is throwing a MissingReferenceException in the Editor is throwing a NullReferenceException when running on mobile devices.</li>\n"]},{"title":"Cause","content":["The following example will throw different exceptions depending on where it is executed (in either the Editor or Player):","using UnityEngine;\nusing System.Collections;\n\npublic class TestExceptions : MonoBehaviour {\n\n    GameObject myGameObject = null;\n\n    void Start ()\n    {\n        myGameObject = new GameObject(&quot;MyGameObject&quot;);\n        Destroy(myGameObject);\n        StartCoroutine(Test());\n    }\n\n    IEnumerator Test()\n    {\n        yield return new WaitForSeconds(2);\n        Debug.Log(myGameObject.name);    // MissingReferenceException / NullReferenceException\n    }\n}\n","In this case, a MissingReferenceException is only thrown in the Editor and a NullReferenceException in the Player. The is because Unity is a C/C++ engine, and all the actual information about this <strong>myGameObject</strong> is in the C++ side.","The only thing that the C# object has is a pointer to the native object, so <strong>Destroy(myGameObject)</strong> destroys the native object but the managed object in the C# side still exists, and is destroyed when it&apos;s no longer referenced and is collected by the garbage collector.","Similarly, when a MonoBehaviour in the Editor has fields, Unity doesn&#x2019;t set those fields to a &quot;real&quot; null value but instead a &quot;fake&quot; null object. This allows Unity to store information that gives you more contextual information when you invoke a method on it, or when you ask the object for a property.","Without this approach, you only get a NullReferenceException and have no idea which GameObject has the MonoBehaviour with the null field. With this fake null approach, Unity highlights the GameObject in the Inspector and also gives you more direction about the source of the problem (in this case by throwing an MissingReferenceException)."]},{"title":"Unity doesn’t keep this information in the Player because it should be optimized to run as fast as possible without negatively affecting performance or memory consumption.  Resolution","content":["This is an intended behavior."]},{"title":"More Information","content":["For more information, take a look at the following:","\n<li><a href=\"https://docs.unity3d.com/Manual/NullReferenceException.html\">What is a NullReferenceException?</a></li>\n<li><a href=\"https://blogs.unity3d.com/2014/05/16/custom-operator-should-we-keep-it/\">Custom = = operator, should we keep it?</a>&#xA0;</li>\n"]}]}]