[{"title":"How do I interpret a compiler error?","authorName":"Megan.","createdDate":"2015-09-29T12:16:14Z","updatedDate":"2017-02-10T04:44:46Z","labels":["Scene","Compiler","Editor","Error","UnityScript","C#","Fix"],"sections":[{"title":"Symptoms","content":["\n<li>When I try to play my scene in Unity&#xA0;it says all compiler errors must be fixed first.</li>\n<li>I don&apos;t know where to find the errors in my script.</li>\n"]},{"title":"Cause","content":["Compiler errors are generated by a script that has erroneous code. When you create a script in Unity and click play to test the script is working, you may receive some bright red error text in the collapsed version of the Console located in the bottom left corner of the Unity Editor:","<img src=\"/hc/en-us/article_attachments/201668886/sc1.png\" alt=\"\" width=\"588\" height=\"168\">","The red text is the type of compiler error in your script. The white text with a red warning icon shows the specific compiler error details in your script that needs fixing.","<em>Please note that Unity will not let you play the scene until all compiler errors have been fixed.</em>"]},{"title":"Resolution","content":["Double-click on the white text&#xA0;or go to the Window/Console (Ctrl+Shift+C in Windows) the full console should be visible. If you cannot find it, you may need to reset your layout first with Window/Layouts.","By double clicking on the error message details, this triggers the script to open directly&#xA0;and&#xA0;it should even take you to the exact line where the error was generated so you can fix the error described. Once you have fixed the error, save the script and click on Unity. Unity will compile your changes and write any errors to the console. Continue to fix errors until there are none."]},{"title":"More Information","content":["For more information on why you cannot enter playmode with existing compiler errors then see this article <a href=\"/hc/en-us/articles/205637689\" target=\"_blank\">here</a>","&#xA0;"]}]}]