[{"title":"Why did my install volume change?","authorName":"Unity Ads Support.","createdDate":"2016-07-30T00:39:51Z","updatedDate":"2017-04-13T11:15:10Z","labels":["Ads","Unity Ads","Installs","Performance"],"sections":[{"title":"Symptoms","content":["\n<li>I am seeing changes in my install rate and performance.</li>\n<li>I am seeing decreases/increases in volume.</li>\n"]},{"title":"Cause","content":["You are seeing fluctuations in performance."]},{"title":"Resolution","content":["During the course of the campaign, it is natural to see some fluctuations in performance. Though the figure may vary from campaign to campaign, a 10-15% change either way week over week is considered within the normal range of fluctuation. However, a change in performance greater than this range&#xA0;is worth further analysis.","<strong>Decreases in volume</strong>","Some of the factors that can contribute to a decrease in volume include:","\n<li><strong>A change in the competitive advertiser-side landscape</strong> -&#xA0;Our inventory is constantly changing and growing. Sometimes we start new advertising campaigns that vastly outperform the rest of our network, thus receiving preferential publisher inventory. If this happens, you can raise your bids to compete for this inventory.</li>\n<li><strong>A change in publishers</strong> -&#xA0;Rarely, a publisher will remove their traffic from the inventory altogether.</li>\n<li><strong>A tracking issue</strong> - This could be due to an outage of your third-party tracking service, or due to an uncommunicated change to the postback or tracking URLs.</li>\n<li><strong>Underperforming creatives </strong>-&#xA0;A gradual decrease in volume over time can suggest&#xA0;ad fatigue. The introduction of a new creative that is less resonant with your audience than its predecessor can also cause a decrease in conversion rate and thus a decrease in volume.</li>\n","<strong>Increases in volume</strong>","Comparatively, increases in volume can be attributed to the inverse reasons for decreases:","\n<li><strong>The addition of a well-matched game</strong> - We are constantly adding new games. If we happen to add a game whose users are particularly engaged with your ads, you can often see volume suddenly skyrocket.</li>\n<li><strong>High-performing new creatives</strong> - Advertisers often see noticeable volume increases after conducting a trailer refresh. Rotate in new trailers approximately once per quarter if resources permit.</li>\n"]}]}]